# RPT-YOLO
nc: 2
scales:
  n: [0.33, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [20, 3, 2, 1]]                    # 0
  - [-1, 1, DepthSepConvV2, [40, 3, 1, False]]     # 1
  - [-1, 1, DepthSepConvV2, [80, 3, 2, False]]     # 2
  - [-1, 1, DepthSepConvV2, [80, 3, 1, True]]      # 3
  - [-1, 1, DepthSepConvV2, [160, 3, 2, True]]     # 4
  - [-1, 2, DepthSepConvV2, [160, 3, 1, True]]     # 5  P3/8
  - [-1, 1, DepthSepConvV2, [320, 3, 2, True]]     # 6
  - [-1, 5, DepthSepConvV2, [320, 5, 1, True]]     # 7   P4/16
  - [-1, 1, DepthSepConvV2, [512, 5, 2, True]]     # 8
  - [-1, 2, DepthSepConvV2, [512, 5, 1, True]]     # 9   P5/32

head:

  - [[7, 6, 9], 1, Zoom_cat_Pro, []]               # 10
  - [-1, 2, C2f, [512]]                             # 11
  - [-1, 1, Conv, [256, 1, 1]]                     # 12
  - [[5, 4, -1], 1, Zoom_cat_Pro, []]              # 13
  - [-1, 2, C2f, [256]]                             # 14 (P3-out)
  - [-1, 1, Conv, [256, 3, 2]]                     # 15
  - [[-1, 11], 1, Concat, [1]]                     # 16
  - [-1, 2, C2f, [512]]                             # 17 (P4-out)
  - [-1, 1, Conv, [512, 3, 2]]                     # 18
  - [[-1, 9], 1, Concat, [1]]                      # 19
  - [-1, 2, C2f, [1024]]                            # 20 (P5-out)
  - [[14, 17, 20], 1, Segment, [nc, 32, 128]]      # 21